<h1><u><center>Table Constraints</h1></u></center>

Constraints are the rules that we can apply on the type of data in a table. That is, we can specify the limit on the type of data that can be stored in a particular column in a table using constraints. 

![](https://cdn.educba.com/academy/wp-content/uploads/2019/10/SQL-Constraints.png)

1. <b><u>NOT NULL:</b></u>

This constraint tells that we cannot store a null value in a column. That is, if a column is specified as NOT NULL then we will not be able to store null in this particular column any more.

Example:<br>
CREATE TABLE Student<br>
(<br>
ID int(6) NOT NULL,<br>
ADDRESS varchar(20)<br>
);<br>

# `CHECK THIS FOR MORE EXAMPLES`: https://www.w3schools.com/sql/sql_notnull.asp

### **DATABASE CREATION AND CONNECTING IT**

Run the cell given below for creating a database and connecting it.

In [1]:
import pandas as pd
import sqlite3
sql=sqlite3.connect('table_constraints1.db')
%reload_ext sql
%sql sqlite:///table_constraints1.db

# **`Let's Learn Constraints Now`**

### 1. Create a table "Students" having columns like ID, Name, Class, DOB, etc. using the not null constraint on ID, Name and DOB Column.

In [2]:
%%sql
Create table Students (
    ID int(10) NOT NULL,
    Name Varchar(20) NOT NULL,
    Class varchar (20),
    DOB DATE NOT NULL
)

 * sqlite:///table_constraints1.db
Done.

[]

### 2. Add records in Students table with ID as NULL.

In [3]:
%%sql
Insert into Students values (null , 'Deepan' , 'CSE' , 12-11-1994)

 * sqlite:///table_constraints1.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Students.ID
[SQL: Insert into Students values (null , 'Deepan' , 'CSE' , 12-11-1994)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

Hence, you get the error as IntegrityError: (sqlite3.IntegrityError) NOT NULL constraint failed: students.ID

### 3. Now add certain records in the students table.

In [4]:
%%sql
Insert into Students values (10001 , 'Deepan' , 'CSE' , 12-11-1994) , (10002 , 'Deepa' , 'CSE' , 22-09-1994), (10003 , 'Deepaika' , 'CSE' , 13-08-1995)

 * sqlite:///table_constraints1.db
3 rows affected.

[]

2. <b><u>UNIQUE:</b></u>

This constraint helps to uniquely identify each row in the table. i.e. for a particular column, all the rows should have unique values.

Example:<br>
CREATE TABLE Student<br>
(<br>
ID int(6) NOT NULL UNIQUE,<br>
NAME varchar(10),<br>
);<br>

# `CHECK THIS FOR UNIQUE CONSTRAINT`: https://www.w3schools.com/sql/sql_unique.asp

### 4. Create a table Teachers having columns ID, Name, Salary, Address by applying the unique constraint on ID and Address Columns.

In [5]:
%%sql
Create Table Teachers (
    ID int(10) NOT NULL UNIQUE,
    Name Varchar(20) NOT NULL,
    Salary int (20),
    Address NOT NULL UNIQUE
)

 * sqlite:///table_constraints1.db
Done.

[]

### 5. Add any record in the teachers table having ID 001.

In [16]:
%%sql
Insert into Teachers values (1001 , 'Prasanna' , 29000 , 'Villupuram')

 * sqlite:///table_constraints1.db
1 rows affected.

[]

### 6. Add record having the same ID 001 in teachers table.

In [17]:
%%sql
Insert into Teachers values (1001 , 'Agilam' , 29000 , 'Tanjore')

 * sqlite:///table_constraints1.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Teachers.ID
[SQL: Insert into Teachers values (1001 , 'Agilam' , 29000 , 'Tanjore')]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

Hence you get the error as IntegrityError: (sqlite3.IntegrityError) UNIQUE constraint failed: teachers.ID which means that non unique values are being inserted in the ID column of teachers table.

3. <b><u>PRIMARY KEY:</b></u>

Primary Key is a field which uniquely identifies each row in the table. If a field in a table as primary key, then the field will not be able to contain NULL values as well as all the rows should have unique values for this field. So, in other words we can say that this is combination of NOT NULL and UNIQUE constraints. 
A table can have only one field as primary key. 

Example:<br>
CREATE TABLE Student<br>
(<br>
ID int(6) NOT NULL UNIQUE,<br>
NAME varchar(10),<br>
PRIMARY KEY(ID)<br>
);<br>

# `CHECK THIS FOR PRIMARY KEY`: https://www.w3schools.com/sql/sql_primarykey.ASP

### 7. Create a table Employee having ID, Name, Salary, Designation and ID as the primary key.

In [18]:
%%sql
CREATE TABLE Employee
(
ID int(6) NOT NULL UNIQUE,
NAME varchar(10),
Salary int(10), 
Designation varchar(20), 
PRIMARY KEY(ID)
);

 * sqlite:///table_constraints1.db
Done.

[]

### 8. Insert any records in the Employee table.

In [19]:
%%sql
Insert into Employee values (501 , 'Prasanna' , 29000 , 'TL'),(502 , 'Agilan' , 29000 , 'TL'), 
(503 , 'Vijay' , 29000 , 'TL')

 * sqlite:///table_constraints1.db
3 rows affected.

[]

### 9. Try inserting null record in ID column.

In [21]:
%%sql
Insert into Employee values (null , 'Tamil' , 29000 , 'TL')

 * sqlite:///table_constraints1.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Employee.ID
[SQL: Insert into Employee values (null , 'Tamil' , 29000 , 'TL')]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

Hence an error message popped up saying IntegrityError: (sqlite3.IntegrityError) NOT NULL constraint failed: employee.ID

4. <b><u>FOREIGN KEY:</b></u>

Foreign Key is a field in a table which uniquely identifies each row of a another table. That is, this field points to primary key of another table.

# `CHECK THIS FOR FOREIGN KEY`: https://www.w3schools.com/sql/sql_foreignkey.asp

### 10. Create a table teacher1 having various columns t_ID, Name, Subject, Salary and t_ID as Primary key.

In [23]:
%%sql
Create Table Teachers1 (
    t_ID int(10) NOT NULL UNIQUE,
    Name Varchar(20) NOT NULL,
    Sunbject Varchar(20) NOT NULL,
    Salary int (20),
    PRIMARY KEY(t_ID)
)

 * sqlite:///table_constraints1.db
Done.

[]

### 11. Create a table students1 having columns s_ID, Name, class, t_ID and keep s_ID as Primary key.

In [24]:
%%sql
Create Table Students1 (
    s_ID int(10) NOT NULL UNIQUE,
    Name Varchar(20) NOT NULL,
    Class Varchar(20) ,
    t_ID int (20) NOT NULL,
    PRIMARY KEY(s_ID)
)

 * sqlite:///table_constraints1.db
Done.

[]

From the above tables we can observe that the teacher's ID is also a column in the students table. Hence teacher's ID is a foreign key in the students table as it is the primary key in the teachers table and has been referenced in students table.

5. <b><u>CHECK:</b></u>

Using the CHECK constraint we can specify a condition for a field, which should be satisfied at the time of entering values for this field.

Example:<br>
CREATE TABLE Student<br>
(<br>
ID int(6) NOT NULL,<br>
AGE int NOT NULL CHECK (AGE >= 18)<br>
);

# `CHECK THIS FOR CHECK CONSTRAINT`: https://www.w3schools.com/sql/sql_check.asp

### 12. Create a table students2 having columns s_ID, Name, Marks. Use check constraint in marks column, restrict marks to 35.

In [25]:
%%sql
Create Table Students2 (
    s_ID int(10) NOT NULL UNIQUE,
    Name Varchar(20) NOT NULL,
    Marks int(5) NOT NULL check(Marks > 35),
    PRIMARY KEY(s_ID)
)

 * sqlite:///table_constraints1.db
Done.

[]

Here we created a table that accepts values of marks column only whose value is greater than equal to 35. 

### 13. Insert record into the students2 table by violating the check constraint (enter 25 marks).

In [26]:
%%sql
Insert into Students2 values (401 , 'Tamil' , 29 )

 * sqlite:///table_constraints1.db
(sqlite3.IntegrityError) CHECK constraint failed: Marks > 35
[SQL: Insert into Students2 values (401 , 'Tamil' , 29 )]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

Hence you get ann error which says IntegrityError: (sqlite3.IntegrityError) CHECK constraint failed: students2 this means that the value passed in the marks column is not as specified in the check constraint.

### 14. Insert correct records in the students2 table (having marks greater than 35).

In [28]:
%%sql
Insert into Students2 values (401 , 'Tamil' , 99 ),(402 , 'Ramesh' , 76 ),(403, 'aravind' , 92 )

 * sqlite:///table_constraints1.db
3 rows affected.

[]

6. <b><u>DEFAULT</b></u>

This constraint is used to provide a default value for the fields. 


Example:<br>
CREATE TABLE Student<br>
(<br>
ID int(6) NOT NULL,<br>
AGE int DEFAULT 18<br>
);

# `CHECK THIS FOR DEFAULT CONSTRAINT`: https://www.w3schools.com/sql/sql_check.asp

### 15. Create a table customer having c_ID, Name, Country with default country name as "India".

In [47]:
%%sql
CREATE TABLE customer
(
c_ID int(6) NOT NULL,
Name varchar(20) NOT NULL,
Country varchar(20) DEFAULT 'India'
);

 * sqlite:///table_constraints1.db
Done.

[]

### 16. Insert record in customer table leaving the country value empty and visualize the record using select statement.

In [54]:
%%sql
INSERT INTO customer (c_ID, Name) VALUES (1001,'Deepan')

 * sqlite:///table_constraints1.db
1 rows affected.

[]

In [58]:
%%sql
select * from customer

 * sqlite:///table_constraints1.db
Done.

[(1001, 'Deepan', 'India')]

Hence yoy can see that even when the country name is not inserted in the query, it is by default added to the table.

<b>Congratulations !! You Have Just completed an assignment!!</b>

![](https://sayingimages.com/wp-content/uploads/a-man-like-a-gay-congratulations-meme.jpg)

# **FEEDBACK FORM**

https://docs.google.com/forms/d/e/1FAIpQLScnAaAKvph9R3vINyCtOOMiav-tSMsRGlJReMaHyPjsXDlTIA/viewform